Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="AND Gate &quot;C&quot; Input Enable bit" name="CM1MSKCON__ACEN">
         <value caption="&quot;C&quot; input enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;C&quot; input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="Positive AND Gate Output Select bit" name="CM1MSKCON__PAGS">
         <value caption="The positive output of the AND gate to the OR gate is enabled" name="" value="0x1" />
         <value caption="The positive output of the AND gate to the OR gate is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Negative AND Gate Output Select bit" name="CM1MSKCON__NAGS">
         <value caption="The negative (inverted) output of the AND gate to the OR gate is enabled" name="" value="0x1" />
         <value caption="The negative (inverted) output of the AND gate to the OR gate is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;A&quot; Input Inverted Enable bit" name="CM1MSKCON__OANEN">
         <value caption="&quot;A&quot; input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;A&quot; input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;A&quot; Input Enable bit" name="CM1MSKCON__OAEN">
         <value caption="&quot;A&quot;input enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;A&quot; input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;B&quot; Input Inverted Enable bit" name="CM1MSKCON__OBNEN">
         <value caption="&quot;B&quot; input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;B&quot; input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;B&quot; Input Enable bit" name="CM1MSKCON__OBEN">
         <value caption="&quot;B&quot; input enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;B&quot; input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;C&quot; Input Inverted Enable bit" name="CM1MSKCON__OCNEN">
         <value caption="&quot;C&quot; input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;C&quot; input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;C&quot; Input Enable bit" name="CM1MSKCON__OCEN">
         <value caption="&quot;C&quot; input enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;C&quot; input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="High or Low Level Masking Select bit" name="CM1MSKCON__HLMS">
         <value caption="The comparator deasserted state is 1" name="" value="0x1" />
         <value caption="The comparator deasserted state is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Mask A Input Select bits" name="CM1MSKCON__SELSRCA">
         <value caption="FLT4 pin" name="" value="0xf" />
         <value caption="FLT2 pin" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="PWM6H" name="" value="0xb" />
         <value caption="PWM6L" name="" value="0xa" />
         <value caption="PWM5H" name="" value="0x9" />
         <value caption="PWM5L" name="" value="0x8" />
         <value caption="PWM4H" name="" value="0x7" />
         <value caption="PWM4L" name="" value="0x6" />
         <value caption="PWM3H" name="" value="0x5" />
         <value caption="PWM3L" name="" value="0x4" />
         <value caption="PWM2H" name="" value="0x3" />
         <value caption="PWM2L" name="" value="0x2" />
         <value caption="PWM1H" name="" value="0x1" />
         <value caption="PWM1L" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;A&quot; Inverted Input Enable bit" name="CM2MSKCON__AANEN">
         <value caption="&quot;A&quot; input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;A&quot; input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;A&quot; Input Enable bit" name="CM2MSKCON__AAEN">
         <value caption="&quot;A&quot; input enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;A&quot; input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;B&quot; Inverted Input Enable bit" name="CM2MSKCON__ABNEN">
         <value caption="&quot;B&quot; input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;B&quot; input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;B&quot; Input Enable bit" name="CM2MSKCON__ABEN">
         <value caption="&quot;B&quot; input enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;B&quot; input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;C&quot; Inverted Input Enable bit" name="CM2MSKCON__ACNEN">
         <value caption="&quot;C&quot; input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;C&quot; input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;C&quot; Input Enable bit" name="CM2MSKCON__ACEN">
         <value caption="&quot;C&quot; input enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;C&quot; input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="Positive AND Gate Output Select bit" name="CM2MSKCON__PAGS">
         <value caption="The positive output of the AND gate to the OR gate is enabled" name="" value="0x1" />
         <value caption="The positive output of the AND gate to the OR gate is disabled" name="" value="0x0" />
      </value-group>
