Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="AND Gate &quot;A&quot; Input Enable bit" name="CM5MSKCON__AAEN">
         <value caption="&quot;A&quot; input enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;A&quot; input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;B&quot; Inverted Input Enable bit" name="CM5MSKCON__ABNEN">
         <value caption="&quot;B&quot; input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;B&quot; input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;B&quot; Input Enable bit" name="CM5MSKCON__ABEN">
         <value caption="&quot;B&quot; input enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;B&quot; input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;C&quot; Inverted Input Enable bit" name="CM5MSKCON__ACNEN">
         <value caption="&quot;C&quot; input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;C&quot; input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate &quot;C&quot; Input Enable bit" name="CM5MSKCON__ACEN">
         <value caption="&quot;C&quot; input enabled as input to AND gate" name="" value="0x1" />
         <value caption="&quot;C&quot; input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="Positive AND Gate Output Select bit" name="CM5MSKCON__PAGS">
         <value caption="The positive output of the AND gate to the OR gate is enabled" name="" value="0x1" />
         <value caption="The positive output of the AND gate to the OR gate is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Negative AND Gate Output Select bit" name="CM5MSKCON__NAGS">
         <value caption="The negative (inverted) output of the AND gate to the OR gate is enabled" name="" value="0x1" />
         <value caption="The negative (inverted) output of the AND gate to the OR gate is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;A&quot; Input Inverted Enable bit" name="CM5MSKCON__OANEN">
         <value caption="&quot;A&quot; input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;A&quot; input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;A&quot; Input Enable bit" name="CM5MSKCON__OAEN">
         <value caption="&quot;A&quot;input enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;A&quot; input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;B&quot; Input Inverted Enable bit" name="CM5MSKCON__OBNEN">
         <value caption="&quot;B&quot; input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;B&quot; input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;B&quot; Input Enable bit" name="CM5MSKCON__OBEN">
         <value caption="&quot;B&quot; input enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;B&quot; input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;C&quot; Input Inverted Enable bit" name="CM5MSKCON__OCNEN">
         <value caption="&quot;C&quot; input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;C&quot; input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate &quot;C&quot; Input Enable bit" name="CM5MSKCON__OCEN">
         <value caption="&quot;C&quot; input enabled as input to OR gate" name="" value="0x1" />
         <value caption="&quot;C&quot; input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="High or Low Level Masking Select bit" name="CM5MSKCON__HLMS">
         <value caption="The comparator deasserted state is 1" name="" value="0x1" />
         <value caption="The comparator deasserted state is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Mask A Input Select bits" name="CM5MSKCON__SELSRCA">
         <value caption="FLT4 pin" name="" value="0xf" />
         <value caption="FLT2 pin" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="PWM6H" name="" value="0xb" />
         <value caption="PWM6L" name="" value="0xa" />
         <value caption="PWM5H" name="" value="0x9" />
         <value caption="PWM5L" name="" value="0x8" />
         <value caption="PWM4H" name="" value="0x7" />
         <value caption="PWM4L" name="" value="0x6" />
         <value caption="PWM3H" name="" value="0x5" />
         <value caption="PWM3L" name="" value="0x4" />
         <value caption="PWM2H" name="" value="0x3" />
         <value caption="PWM2L" name="" value="0x2" />
         <value caption="PWM1H" name="" value="0x1" />
         <value caption="PWM1L" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00000" name="CORE" version="">
      <register-group name="CORE" />
   </module>
   <module caption="" id="02823" name="CRU" version="2">
      <register-group name="CRU">
         <register caption="Oscillator Control Register" name="OSCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN" />
            <bitfield caption="Secondary Oscillator (" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN" />
            <bitfield caption="USB FRC Sleep Clock Enable bit" mask="0x00000004" name="UFRCEN" values="OSCCON__UFRCEN" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00000008" name="CF" values="OSCCON__CF" />
            <bitfield caption="Sleep Mode Enable bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN" />
            <bitfield caption="Clock Selection Lock Enable bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK" />
            <bitfield caption="New Oscillator Selection bits" mask="0x00000700" name="NOSC" values="OSCCON__NOSC" />
            <bitfield caption="Current Oscillator Selection bits" mask="0x00007000" name="COSC" values="OSCCON__COSC" />
            <bitfield caption="Sleep Two-speed Start-up Control bit" mask="0x00200000" name="SLP2SPD" values="OSCCON__SLP2SPD" />
            <bitfield caption="Dream Mode Enable bit" mask="0x00800000" name="DRMEN" values="OSCCON__DRMEN" />
            <bitfield caption="Internal Fast RC Oscillator Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV" />
         </register>
