Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
         <register caption="Interrupt Flag Status Register " name="IFS2" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U3TXIF" />
            <bitfield mask="0x00000002" name="U4EIF" />
            <bitfield mask="0x00000004" name="U4RXIF" />
            <bitfield mask="0x00000008" name="U4TXIF" />
            <bitfield mask="0x00000010" name="U5EIF" />
            <bitfield mask="0x00000020" name="U5RXIF" />
            <bitfield mask="0x00000040" name="U5TXIF" />
            <bitfield mask="0x00000080" name="CTMUIF" />
            <bitfield mask="0x00000100" name="DMA0IF" />
            <bitfield mask="0x00000200" name="DMA1IF" />
            <bitfield mask="0x00000400" name="DMA2IF" />
            <bitfield mask="0x00000800" name="DMA3IF" />
            <bitfield mask="0x00001000" name="T6IF" />
            <bitfield mask="0x00002000" name="IC6EIF" />
            <bitfield mask="0x00004000" name="IC6IF" />
            <bitfield mask="0x00008000" name="OC6IF" />
            <bitfield mask="0x00010000" name="T7IF" />
            <bitfield mask="0x00020000" name="IC7EIF" />
            <bitfield mask="0x00040000" name="IC7IF" />
            <bitfield mask="0x00080000" name="OC7IF" />
            <bitfield mask="0x00100000" name="T8IF" />
            <bitfield mask="0x00200000" name="IC8EIF" />
            <bitfield mask="0x00400000" name="IC8IF" />
            <bitfield mask="0x00800000" name="OC8IF" />
            <bitfield mask="0x01000000" name="T9IF" />
            <bitfield mask="0x02000000" name="IC9EIF" />
            <bitfield mask="0x04000000" name="IC9IF" />
            <bitfield mask="0x08000000" name="OC9IF" />
            <bitfield mask="0x10000000" name="AD1IF" />
            <bitfield mask="0x40000000" name="AD1DC1IF" />
            <bitfield mask="0x80000000" name="AD1DC2IF" />
         </register>
         <register caption="Interrupt Flag Status Register " name="IFS3" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1DF1IF" />
            <bitfield mask="0x00000002" name="AD1DF2IF" />
            <bitfield mask="0x00000004" name="AD1DF3IF" />
            <bitfield mask="0x00000008" name="AD1DF4IF" />
            <bitfield mask="0x00000010" name="AD1FIIF" />
            <bitfield mask="0x00000020" name="AD1EOSIF" />
            <bitfield mask="0x00000040" name="AD1ARIF" />
            <bitfield mask="0x00000080" name="AD1RSIF" />
            <bitfield mask="0x00000100" name="AD1FCBTIF" />
            <bitfield mask="0x00000200" name="AD1GIF" />
            <bitfield mask="0x00000400" name="AD1D0IF" />
            <bitfield mask="0x00000800" name="AD1D1IF" />
            <bitfield mask="0x00001000" name="AD1D2IF" />
            <bitfield mask="0x00002000" name="AD1D3IF" />
            <bitfield mask="0x00004000" name="AD1D4IF" />
            <bitfield mask="0x00008000" name="AD1D5IF" />
            <bitfield mask="0x00010000" name="AD1D6IF" />
            <bitfield mask="0x00020000" name="AD1D7IF" />
            <bitfield mask="0x00040000" name="AD1D8IF" />
            <bitfield mask="0x00080000" name="AD1D9IF" />
            <bitfield mask="0x00100000" name="AD1D10IF" />
            <bitfield mask="0x00200000" name="AD1D11IF" />
            <bitfield mask="0x00400000" name="AD1D12IF" />
            <bitfield mask="0x00800000" name="AD1D13IF" />
            <bitfield mask="0x01000000" name="AD1D14IF" />
            <bitfield mask="0x02000000" name="AD1D15IF" />
            <bitfield mask="0x04000000" name="AD1D16IF" />
            <bitfield mask="0x08000000" name="AD1D17IF" />
            <bitfield mask="0x10000000" name="AD1D18IF" />
            <bitfield mask="0x20000000" name="AD1D19IF" />
            <bitfield mask="0x40000000" name="AD1D20IF" />
            <bitfield mask="0x80000000" name="AD1D21IF" />
         </register>
         <register caption="Interrupt Flag Status Register " name="IFS4" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1D22IF" />
            <bitfield mask="0x00000002" name="AD1D23IF" />
            <bitfield mask="0x00000004" name="AD1D24IF" />
            <bitfield mask="0x00000008" name="AD1D25IF" />
            <bitfield mask="0x00000010" name="AD1D26IF" />
            <bitfield mask="0x00000020" name="AD1D27IF" />
            <bitfield mask="0x00000800" name="AD1D33IF" />
            <bitfield mask="0x00001000" name="AD1D34IF" />
            <bitfield mask="0x00002000" name="AD1D35IF" />
            <bitfield mask="0x00004000" name="AD1D36IF" />
            <bitfield mask="0x00008000" name="AD1D37IF" />
            <bitfield mask="0x00010000" name="AD1D38IF" />
            <bitfield mask="0x00020000" name="AD1D39IF" />
            <bitfield mask="0x00040000" name="AD1D40IF" />
            <bitfield mask="0x00080000" name="AD1D41IF" />
            <bitfield mask="0x00800000" name="AD1D45IF" />
            <bitfield mask="0x01000000" name="AD1D46IF" />
            <bitfield mask="0x02000000" name="AD1D47IF" />
            <bitfield mask="0x04000000" name="AD1D48IF" />
            <bitfield mask="0x08000000" name="AD1D49IF" />
            <bitfield mask="0x10000000" name="AD1D50IF" />
            <bitfield mask="0x20000000" name="AD1D51IF" />
            <bitfield mask="0x40000000" name="AD1D52IF" />
            <bitfield mask="0x80000000" name="AD1D53IF" />
         </register>
         <register caption="Interrupt Flag Status Register " name="IFS5" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP3IF" />
            <bitfield mask="0x00000002" name="CMP4IF" />
            <bitfield mask="0x00000004" name="CMP5IF" />
            <bitfield mask="0x00000010" name="U6EIF" />
            <bitfield mask="0x00000020" name="U6RXIF" />
            <bitfield mask="0x00000040" name="U6TXIF" />
            <bitfield mask="0x00000080" name="CAN1IF" />
            <bitfield mask="0x00000100" name="CAN2IF" />
            <bitfield mask="0x00000200" name="QEI1IF" />
            <bitfield mask="0x00000400" name="QEI2IF" />
            <bitfield mask="0x00000800" name="PWMPEVTIF" />
            <bitfield mask="0x00001000" name="PWMSEVTIF" />
            <bitfield mask="0x00002000" name="PWM1IF" />
            <bitfield mask="0x00004000" name="PWM2IF" />
            <bitfield mask="0x00008000" name="PWM3IF" />
            <bitfield mask="0x00010000" name="PWM4IF" />
            <bitfield mask="0x00020000" name="PWM5IF" />
            <bitfield mask="0x00040000" name="PWM6IF" />
            <bitfield mask="0x00080000" name="I2C3BIF" />
            <bitfield mask="0x00100000" name="I2C3SIF" />
            <bitfield mask="0x00200000" name="I2C3MIF" />
            <bitfield mask="0x00400000" name="DMA4IF" />
            <bitfield mask="0x00800000" name="DMA5IF" />
            <bitfield mask="0x01000000" name="DMA6IF" />
            <bitfield mask="0x02000000" name="DMA7IF" />
            <bitfield mask="0x04000000" name="DATAEEIF" />
            <bitfield mask="0x08000000" name="CAN3IF" />
            <bitfield mask="0x10000000" name="CAN4IF" />
            <bitfield mask="0x20000000" name="QEI3IF" />
            <bitfield mask="0x40000000" name="QEI4IF" />
            <bitfield mask="0x80000000" name="QEI5IF" />
         </register>
         <register caption="Interrupt Flag Status Register " name="IFS6" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="QEI6IF" />
            <bitfield mask="0x00000004" name="I2C4BIF" />
            <bitfield mask="0x00000008" name="I2C4SIF" />
            <bitfield mask="0x00000010" name="I2C4MIF" />
            <bitfield mask="0x00000020" name="IC10EIF" />
            <bitfield mask="0x00000040" name="IC10IF" />
            <bitfield mask="0x00000080" name="OC10IF" />
            <bitfield mask="0x00000100" name="IC11EIF" />
            <bitfield mask="0x00000200" name="IC11IF" />
            <bitfield mask="0x00000400" name="OC11IF" />
            <bitfield mask="0x00000800" name="IC12EIF" />
            <bitfield mask="0x00001000" name="IC12IF" />
            <bitfield mask="0x00002000" name="OC12IF" />
            <bitfield mask="0x00004000" name="IC13EIF" />
            <bitfield mask="0x00008000" name="IC13IF" />
            <bitfield mask="0x00010000" name="OC13IF" />
            <bitfield mask="0x00020000" name="IC14EIF" />
            <bitfield mask="0x00040000" name="IC14IF" />
            <bitfield mask="0x00080000" name="OC14IF" />
            <bitfield mask="0x00100000" name="IC15EIF" />
            <bitfield mask="0x00200000" name="IC15IF" />
            <bitfield mask="0x00400000" name="OC15IF" />
            <bitfield mask="0x00800000" name="IC16EIF" />
            <bitfield mask="0x01000000" name="IC16IF" />
            <bitfield mask="0x02000000" name="OC16IF" />
            <bitfield mask="0x04000000" name="SPI3EIF" />
            <bitfield mask="0x08000000" name="SPI3RXIF" />
            <bitfield mask="0x10000000" name="SPI3TXIF" />
            <bitfield mask="0x20000000" name="SPI4EIF" />
            <bitfield mask="0x40000000" name="SPI4RXIF" />
            <bitfield mask="0x80000000" name="SPI4TXIF" />
         </register>
