Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
         <register caption="Interrupt Priority Control Register " name="IPC31" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D18IS" />
            <bitfield mask="0x0000001C" name="AD1D18IP" />
            <bitfield mask="0x00000300" name="AD1D19IS" />
            <bitfield mask="0x00001C00" name="AD1D19IP" />
            <bitfield mask="0x00030000" name="AD1D20IS" />
            <bitfield mask="0x001C0000" name="AD1D20IP" />
            <bitfield mask="0x03000000" name="AD1D21IS" />
            <bitfield mask="0x1C000000" name="AD1D21IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC32" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D22IS" />
            <bitfield mask="0x0000001C" name="AD1D22IP" />
            <bitfield mask="0x00000300" name="AD1D23IS" />
            <bitfield mask="0x00001C00" name="AD1D23IP" />
            <bitfield mask="0x00030000" name="AD1D24IS" />
            <bitfield mask="0x001C0000" name="AD1D24IP" />
            <bitfield mask="0x03000000" name="AD1D25IS" />
            <bitfield mask="0x1C000000" name="AD1D25IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC33" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D26IS" />
            <bitfield mask="0x0000001C" name="AD1D26IP" />
            <bitfield mask="0x00000300" name="AD1D27IS" />
            <bitfield mask="0x00001C00" name="AD1D27IP" />
            <bitfield mask="0x00030000" name="AD1D28IS" />
            <bitfield mask="0x001C0000" name="AD1D28IP" />
            <bitfield mask="0x03000000" name="AD1D29IS" />
            <bitfield mask="0x1C000000" name="AD1D29IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC34" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D30IS" />
            <bitfield mask="0x0000001C" name="AD1D30IP" />
            <bitfield mask="0x00000300" name="AD1D31IS" />
            <bitfield mask="0x00001C00" name="AD1D31IP" />
            <bitfield mask="0x00030000" name="AD1D32IS" />
            <bitfield mask="0x001C0000" name="AD1D32IP" />
            <bitfield mask="0x03000000" name="AD1D33IS" />
            <bitfield mask="0x1C000000" name="AD1D33IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC35" offset="0x370" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D34IS" />
            <bitfield mask="0x0000001C" name="AD1D34IP" />
            <bitfield mask="0x00000300" name="AD1D35IS" />
            <bitfield mask="0x00001C00" name="AD1D35IP" />
            <bitfield mask="0x00030000" name="AD1D36IS" />
            <bitfield mask="0x001C0000" name="AD1D36IP" />
            <bitfield mask="0x03000000" name="AD1D37IS" />
            <bitfield mask="0x1C000000" name="AD1D37IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC36" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D38IS" />
            <bitfield mask="0x0000001C" name="AD1D38IP" />
            <bitfield mask="0x00000300" name="AD1D39IS" />
            <bitfield mask="0x00001C00" name="AD1D39IP" />
            <bitfield mask="0x00030000" name="AD1D40IS" />
            <bitfield mask="0x001C0000" name="AD1D40IP" />
            <bitfield mask="0x03000000" name="AD1D41IS" />
            <bitfield mask="0x1C000000" name="AD1D41IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC37" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x03000000" name="AD1D45IS" />
            <bitfield mask="0x1C000000" name="AD1D45IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC38" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D46IS" />
            <bitfield mask="0x0000001C" name="AD1D46IP" />
            <bitfield mask="0x00000300" name="AD1D47IS" />
            <bitfield mask="0x00001C00" name="AD1D47IP" />
            <bitfield mask="0x00030000" name="AD1D48IS" />
            <bitfield mask="0x001C0000" name="AD1D48IP" />
            <bitfield mask="0x03000000" name="AD1D49IS" />
            <bitfield mask="0x1C000000" name="AD1D49IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC39" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D50IS" />
            <bitfield mask="0x0000001C" name="AD1D50IP" />
            <bitfield mask="0x00000300" name="AD1D51IS" />
            <bitfield mask="0x00001C00" name="AD1D51IP" />
            <bitfield mask="0x00030000" name="AD1D52IS" />
            <bitfield mask="0x001C0000" name="AD1D52IP" />
            <bitfield mask="0x03000000" name="AD1D53IS" />
            <bitfield mask="0x1C000000" name="AD1D53IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC40" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CMP3IS" />
            <bitfield mask="0x0000001C" name="CMP3IP" />
            <bitfield mask="0x00000300" name="CMP4IS" />
            <bitfield mask="0x00001C00" name="CMP4IP" />
            <bitfield mask="0x00030000" name="CMP5IS" />
            <bitfield mask="0x001C0000" name="CMP5IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC41" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U6EIS" />
            <bitfield mask="0x0000001C" name="U6EIP" />
            <bitfield mask="0x00000300" name="U6RXIS" />
            <bitfield mask="0x00001C00" name="U6RXIP" />
            <bitfield mask="0x00030000" name="U6TXIS" />
            <bitfield mask="0x001C0000" name="U6TXIP" />
            <bitfield mask="0x03000000" name="CAN1IS" />
            <bitfield mask="0x1C000000" name="CAN1IP" />
         </register>
         <register caption="Interrupt Priority Control Register " name="IPC42" offset="0x3e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CAN2IS" />
            <bitfield mask="0x0000001C" name="CAN2IP" />
            <bitfield mask="0x00000300" name="QEI1IS" />
            <bitfield mask="0x00001C00" name="QEI1IP" />
            <bitfield mask="0x00030000" name="QEI2IS" />
            <bitfield mask="0x001C0000" name="QEI2IP" />
            <bitfield mask="0x03000000" name="PWMPEVTSIP" />
            <bitfield mask="0x1C000000" name="PWMPEVTIP" />
         </register>
