Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="Interrupt with Priority Level 4 Shadow Set bits" name="PRISS__PRI4SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 5 Shadow Set bits" name="PRISS__PRI5SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 6 Shadow Set bits" name="PRISS__PRI6SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 7 Shadow Set bits" name="PRISS__PRI7SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Priority Level bits for Single Vector Mode bits" name="INTSTAT__SRIPL">
         <value caption="Latest interrupt presented to the CPU was at priority level 7" name="" value="0x7" />
         <value caption="Latest interrupt presented to the CPU was at priority level 6" name="" value="0x6" />
         <value caption="Latest interrupt presented to the CPU was at priority level 5" name="" value="0x5" />
         <value caption="Latest interrupt presented to the CPU was at priority level 4" name="" value="0x4" />
         <value caption="Latest interrupt presented to the CPU was at priority level 3" name="" value="0x3" />
         <value caption="Latest interrupt presented to the CPU was at priority level 2" name="" value="0x2" />
         <value caption="Latest interrupt presented to the CPU was at priority level 1" name="" value="0x1" />
         <value caption="Latest interrupt presented to the CPU was at priority level 0" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02869" name="JTAG" version="2">
      <register-group name="JTAG">
         <register caption="" name="_ICDCON" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CKSWBKEN" />
            <bitfield mask="0x00000002" name="SLPBKEN" />
            <bitfield mask="0x00000004" name="WDTBKEN" />
            <bitfield mask="0x00000008" name="WDTEN" />
            <bitfield mask="0x00000010" name="RSTBUG" />
            <bitfield mask="0x00000020" name="DMTBKEN" />
            <bitfield mask="0x00000040" name="DMTEN" />
            <bitfield mask="0x00004000" name="FRZ" />
         </register>
         <register caption="" name="_ICDSTAT" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CKSWBF" />
            <bitfield mask="0x00000002" name="SLPBF" />
            <bitfield mask="0x00000004" name="WDTBF" />
            <bitfield mask="0x00000008" name="DMTBF" />
            <bitfield mask="0x00000010" name="WDTRUNBF" />
            <bitfield mask="0x00000020" name="WDTSLPBF" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01477" name="MCPWMMODULE" version="1">
      <register-group name="MCPWMMODULE">
         <register caption="PWM Primary Time Base Control Register" name="PTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="PWM Special Event Trigger Output Postscaler Select bits" mask="0x0000000F" name="SEVTPS" values="PTCON__SEVTPS" />
            <bitfield caption="Primary PWM Input Clock Prescaler bits" mask="0x00000070" name="PCLKDIV" values="PTCON__PCLKDIV" />
            <bitfield caption="PWM Module Status bit" mask="0x00000400" name="PWMRDY" values="PTCON__PWMRDY" />
            <bitfield caption="Special Event Interrupt Enable bit" mask="0x00000800" name="SEIEN" values="PTCON__SEIEN" />
            <bitfield caption="Special Event Interrupt Status bit" mask="0x00001000" name="SESTAT" values="PTCON__SESTAT" />
            <bitfield caption="PWM Time Base Stop in Idle Mode bit" mask="0x00002000" name="PTSIDL" values="PTCON__PTSIDL" />
            <bitfield caption="PWM Module Enable bit" mask="0x00008000" name="PTEN" values="PTCON__PTEN" />
         </register>
         <register caption="Primary Master Time Base Period Register" name="PTPER" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PTPER" />
         </register>
         <register caption="PWM Primary Special Event Compare Register" name="SEVTCMP" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SEVTCMP" />
         </register>
         <register caption="Primary Master Time Base Timer Register" name="PMTMR" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PMTMR" />
         </register>
         <register caption="Secondary Master Time Base Control Register" name="STCON" offset="0x40" rw="RW" size="4">
            <bitfield caption="PWM Secondary Special Event Trigger Output Postscaler Select bits" mask="0x0000000F" name="SEVTPS" values="STCON__SEVTPS" />
            <bitfield caption="Secondary PWM Input Clock Prescaler" mask="0x00000070" name="SCLKDIV" values="STCON__SCLKDIV" />
            <bitfield caption="Secondary Special Event Interrupt Enable bit" mask="0x00000800" name="SSEIEN" values="STCON__SSEIEN" />
            <bitfield caption="Secondary Special Event Interrupt Status bit" mask="0x00001000" name="SSESTAT" values="STCON__SSESTAT" />
         </register>
         <register caption="Secondary Master Time Base Period Register" name="STPER" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STPER" />
         </register>
