Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON4" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON4__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON4__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON4__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON4__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON4__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON4__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON4__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON4__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON4__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON4__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON4__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON4__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON4__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON4__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON4__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON4__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON5" offset="0x4d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON5__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON5__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON5__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON5__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON5__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON5__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON5__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON5__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON5__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON5__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON5__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON5__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON5__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON5__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON5__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON5__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON6" offset="0x5d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON6__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON6__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON6__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON6__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON6__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON6__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON6__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON6__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON6__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON6__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON6__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON6__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON6__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON6__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON6__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON6__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON7" offset="0x6d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON7__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON7__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON7__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON7__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON7__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON7__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON7__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON7__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON7__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON7__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON7__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON7__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON7__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON7__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON7__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON7__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON8" offset="0x7d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON8__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON8__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON8__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON8__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON8__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON8__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON8__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON8__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON8__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON8__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON8__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON8__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON8__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON8__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON8__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON8__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON9" offset="0x8d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON9__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON9__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON9__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON9__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON9__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON9__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON9__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON9__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON9__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON9__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON9__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON9__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON9__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON9__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON9__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON9__CLSRC" />
         </register>
