Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="Output Override Synchronization bit" name="IOCON8__OSYNC">
         <value caption="Output overrides through the OVRDAT bits are synchronized to the PWM time base" name="" value="0x1" />
         <value caption="Output overrides through the OVRDAT bits occur on next CPU clock boundary" name="" value="0x0" />
      </value-group>
      <value-group caption="SWAP PWMxH and PWMxL Pins bit" name="IOCON8__SWAP">
         <value caption="PWMxH output signal is connected to PWMxL pin; PWMxL output signal is connected to PWMxH pin" name="" value="0x1" />
         <value caption="PWMxH and PWMxL output signals pins are mapped to their respective pins" name="" value="0x0" />
      </value-group>
      <value-group caption="State for PWMxH" name="IOCON8__OVRDAT">
         <value caption="1" name="" value="If OVRENH" />
         <value caption="1" name="" value="If OVRENL" />
      </value-group>
      <value-group caption="Override Enable for PWMxL Pin bit" name="IOCON8__OVRENL">
         <value caption="OVRDAT provides data for output on PWMxL pin" name="" value="0x1" />
         <value caption="PWM generator provides data for PWMxL pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Override Enable for PWMxH Pin bit" name="IOCON8__OVRENH">
         <value caption="OVRDAT provides data for output on PWMxH pin" name="" value="0x1" />
         <value caption="PWM generator provides data for PWMxH pin" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM x I/O Pin Mode bits" name="IOCON8__PMOD">
         <value caption="PWMxL output is held at logic 0 (adjusted by the POLL bit)" name="" value="0x3" />
         <value caption="PWM I/O pin pair is in Push-Pull Output mode" name="" value="0x2" />
         <value caption="PWM I/O pin pair is in Redundant Output mode" name="" value="0x1" />
         <value caption="PWM I/O pin pair is in Complementary Output mode" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Pin Polarity bit" name="IOCON8__POLL">
         <value caption="PWMxL pin is active-low" name="" value="0x1" />
         <value caption="PWMxL pin is active-high" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Pin Polarity bit" name="IOCON8__POLH">
         <value caption="PWMxH pin is active-low" name="" value="0x1" />
         <value caption="PWMxH pin is active-high" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Pin Ownership bit" name="IOCON8__PENL">
         <value caption="PWM module controls PWMxL pin" name="" value="0x1" />
         <value caption="GPIO module controls PWMxL pin" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Pin Ownership bit" name="IOCON8__PENH">
         <value caption="PWM module controls PWMxH pin" name="" value="0x1" />
         <value caption="GPIO module controls PWMxH pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Mode bits for PWM Generator x" name="IOCON8__FLTMOD">
         <value caption="Fault input is disabled" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Selected fault source forces PWMxH" name="" value="0x1" />
         <value caption="Selected fault source forces PWMxH" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Polarity bits for PWM Generator x" name="IOCON8__FLTPOL">
         <value caption="The selected fault source is active-low" name="" value="0x1" />
         <value caption="The selected fault source is active-high" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Control Signal Source Select bits for PWM Generator x" name="IOCON8__FLTSRC">
         <value caption="FLT15" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 5" name="" value="0xc" />
         <value caption="Comparator 4" name="" value="0xb" />
         <value caption="Comparator 3" name="" value="0xa" />
         <value caption="Comparator 2" name="" value="0x9" />
         <value caption="Comparator 1" name="" value="0x8" />
         <value caption="FLT8" name="" value="0x7" />
         <value caption="FLT7" name="" value="0x6" />
         <value caption="FLT6" name="" value="0x5" />
         <value caption="FLT5" name="" value="0x4" />
         <value caption="FLT4" name="" value="0x3" />
         <value caption="FLT3" name="" value="0x2" />
         <value caption="FLT2" name="" value="0x1" />
         <value caption="FLT1" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Mode Enable bit for PWM Generator x" name="IOCON8__CLMOD">
         <value caption="Current-limit function is enabled" name="" value="0x1" />
         <value caption="Current-limit function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Polarity bits for PWM Generator x" name="IOCON8__CLPOL">
         <value caption="The selected current-limit source is active-low" name="" value="0x1" />
         <value caption="The selected current-limit source is active-high" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Control Signal Source select bit for PWM Generator x" name="IOCON8__CLSRC">
         <value caption="FLT15" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 5" name="" value="0xc" />
         <value caption="Comparator 4" name="" value="0xb" />
         <value caption="Comparator 3" name="" value="0xa" />
         <value caption="Comparator 2" name="" value="0x9" />
         <value caption="Comparator 1" name="" value="0x8" />
         <value caption="FLT8" name="" value="0x7" />
         <value caption="FLT7" name="" value="0x6" />
         <value caption="FLT6" name="" value="0x5" />
         <value caption="FLT5" name="" value="0x4" />
         <value caption="FLT4" name="" value="0x3" />
         <value caption="FLT3" name="" value="0x2" />
         <value caption="FLT2" name="" value="0x1" />
         <value caption="FLT1" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Override Synchronization bit" name="IOCON9__OSYNC">
         <value caption="Output overrides through the OVRDAT bits are synchronized to the PWM time base" name="" value="0x1" />
         <value caption="Output overrides through the OVRDAT bits occur on next CPU clock boundary" name="" value="0x0" />
      </value-group>
      <value-group caption="SWAP PWMxH and PWMxL Pins bit" name="IOCON9__SWAP">
         <value caption="PWMxH output signal is connected to PWMxL pin; PWMxL output signal is connected to PWMxH pin" name="" value="0x1" />
         <value caption="PWMxH and PWMxL output signals pins are mapped to their respective pins" name="" value="0x0" />
      </value-group>
      <value-group caption="State for PWMxH" name="IOCON9__OVRDAT">
         <value caption="1" name="" value="If OVRENH" />
         <value caption="1" name="" value="If OVRENL" />
      </value-group>
      <value-group caption="Override Enable for PWMxL Pin bit" name="IOCON9__OVRENL">
         <value caption="OVRDAT provides data for output on PWMxL pin" name="" value="0x1" />
         <value caption="PWM generator provides data for PWMxL pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Override Enable for PWMxH Pin bit" name="IOCON9__OVRENH">
         <value caption="OVRDAT provides data for output on PWMxH pin" name="" value="0x1" />
         <value caption="PWM generator provides data for PWMxH pin" name="" value="0x0" />
      </value-group>
