Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON9__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Leading-Edge Blanking Enable bit" name="LEBCON10__CLLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected current-limit input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected current-limit input" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Input Leading-Edge Blanking Enable bit" name="LEBCON10__FLTLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected fault input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected fault input" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON10__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON10__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON10__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON10__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Leading-Edge Blanking Enable bit" name="LEBCON11__CLLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected current-limit input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected current-limit input" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Input Leading-Edge Blanking Enable bit" name="LEBCON11__FLTLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected fault input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected fault input" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON11__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON11__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON11__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON11__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Leading-Edge Blanking Enable bit" name="LEBCON12__CLLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected current-limit input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected current-limit input" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Input Leading-Edge Blanking Enable bit" name="LEBCON12__FLTLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected fault input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected fault input" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON12__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON12__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON12__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON12__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
