Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON1__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON1__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON1__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON2__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON2__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON2__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON3__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON3__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON3__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON4__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON4__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON4__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON5__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON5__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON5__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON6__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON6__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON6__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
