Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON7__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON7__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON7__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON8__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON8__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON8__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON9__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON9__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON9__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON10__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON10__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON10__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON11__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON11__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON11__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON12__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON12__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON12__CHOPSEL">
         <value caption="Reserved. Do not use" name="" value="0xf" />
         <value caption="Reserved. Do not use" name="" value="0xe" />
         <value caption="Reserved. Do not use" name="" value="0xd" />
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
   </module>
