Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
         <register caption="QEIx Status Register" name="QEI5STAT" offset="0x820" rw="RW" size="4">
            <bitfield caption="Index Input Event Interrupt Enable bit" mask="0x00000001" name="IDXIEN" values="QEI5STAT__IDXIEN" />
            <bitfield caption="Status Flag for Index Event Status bit" mask="0x00000002" name="IDXIRQ" values="QEI5STAT__IDXIRQ" />
            <bitfield caption="Home Input Event Interrupt Enable bit" mask="0x00000004" name="HOMIEN" values="QEI5STAT__HOMIEN" />
            <bitfield caption="Status Flag for Home Event Status bit" mask="0x00000008" name="HOMIRQ" values="QEI5STAT__HOMIRQ" />
            <bitfield caption="Velocity Counter Overflow Interrupt Enable bit" mask="0x00000010" name="VELOVIEN" values="QEI5STAT__VELOVIEN" />
            <bitfield caption="Velocity Counter Overflow Status bit" mask="0x00000020" name="VELOVIRQ" values="QEI5STAT__VELOVIRQ" />
            <bitfield caption="Position Counter Initialization Process Complete Interrupt Enable bit" mask="0x00000040" name="PCIIEN" values="QEI5STAT__PCIIEN" />
            <bitfield caption="Position Counter Initialization Process Complete Status bit " mask="0x00000080" name="PCIIRQ" values="QEI5STAT__PCIIRQ" />
            <bitfield caption="Position Counter Overflow Interrupt Enable bit" mask="0x00000100" name="POSOVIEN" values="QEI5STAT__POSOVIEN" />
            <bitfield caption="Position Counter Overflow Status bit" mask="0x00000200" name="POSOVIRQ" values="QEI5STAT__POSOVIRQ" />
            <bitfield caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" mask="0x00000400" name="PCLEQIEN" values="QEI5STAT__PCLEQIEN" />
            <bitfield caption="Position Counter Less Than or Equal Compare Status bit" mask="0x00000800" name="PCLEQIRQ" values="QEI5STAT__PCLEQIRQ" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" mask="0x00001000" name="PCHEQIEN" values="QEI5STAT__PCHEQIEN" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Status bit" mask="0x00002000" name="PCHEQIRQ" values="QEI5STAT__PCHEQIRQ" />
         </register>
         <register caption="QEIx Status Register" name="QEI6STAT" offset="0xa20" rw="RW" size="4">
            <bitfield caption="Index Input Event Interrupt Enable bit" mask="0x00000001" name="IDXIEN" values="QEI6STAT__IDXIEN" />
            <bitfield caption="Status Flag for Index Event Status bit" mask="0x00000002" name="IDXIRQ" values="QEI6STAT__IDXIRQ" />
            <bitfield caption="Home Input Event Interrupt Enable bit" mask="0x00000004" name="HOMIEN" values="QEI6STAT__HOMIEN" />
            <bitfield caption="Status Flag for Home Event Status bit" mask="0x00000008" name="HOMIRQ" values="QEI6STAT__HOMIRQ" />
            <bitfield caption="Velocity Counter Overflow Interrupt Enable bit" mask="0x00000010" name="VELOVIEN" values="QEI6STAT__VELOVIEN" />
            <bitfield caption="Velocity Counter Overflow Status bit" mask="0x00000020" name="VELOVIRQ" values="QEI6STAT__VELOVIRQ" />
            <bitfield caption="Position Counter Initialization Process Complete Interrupt Enable bit" mask="0x00000040" name="PCIIEN" values="QEI6STAT__PCIIEN" />
            <bitfield caption="Position Counter Initialization Process Complete Status bit " mask="0x00000080" name="PCIIRQ" values="QEI6STAT__PCIIRQ" />
            <bitfield caption="Position Counter Overflow Interrupt Enable bit" mask="0x00000100" name="POSOVIEN" values="QEI6STAT__POSOVIEN" />
            <bitfield caption="Position Counter Overflow Status bit" mask="0x00000200" name="POSOVIRQ" values="QEI6STAT__POSOVIRQ" />
            <bitfield caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" mask="0x00000400" name="PCLEQIEN" values="QEI6STAT__PCLEQIEN" />
            <bitfield caption="Position Counter Less Than or Equal Compare Status bit" mask="0x00000800" name="PCLEQIRQ" values="QEI6STAT__PCLEQIRQ" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" mask="0x00001000" name="PCHEQIEN" values="QEI6STAT__PCHEQIEN" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Status bit" mask="0x00002000" name="PCHEQIRQ" values="QEI6STAT__PCHEQIRQ" />
         </register>
         <register caption="Position Counter Register" name="POS1CNT" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="Position Counter Register" name="POS2CNT" offset="0x230" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="Position Counter Register" name="POS3CNT" offset="0x430" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="Position Counter Register" name="POS4CNT" offset="0x630" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="Position Counter Register" name="POS5CNT" offset="0x830" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="Position Counter Register" name="POS6CNT" offset="0xa30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="" name="POS1HLD" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="" name="POS2HLD" offset="0x240" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="" name="POS3HLD" offset="0x440" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="" name="POS4HLD" offset="0x640" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="" name="POS5HLD" offset="0x840" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="" name="POS6HLD" offset="0xa40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="Velocity Counter Register" name="VEL1CNT" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="Velocity Counter Register" name="VEL2CNT" offset="0x250" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="Velocity Counter Register" name="VEL3CNT" offset="0x450" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="Velocity Counter Register" name="VEL4CNT" offset="0x650" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="Velocity Counter Register" name="VEL5CNT" offset="0x850" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELCNT" />
         </register>
