Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
         <register caption="Velocity Counter Register" name="VEL6CNT" offset="0xa50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="Velocity Hold Register" name="VEL1HLD" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="Velocity Hold Register" name="VEL2HLD" offset="0x260" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="Velocity Hold Register" name="VEL3HLD" offset="0x460" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="Velocity Hold Register" name="VEL4HLD" offset="0x660" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="Velocity Hold Register" name="VEL5HLD" offset="0x860" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="Velocity Hold Register" name="VEL6HLD" offset="0xa60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="Interval Timer Register" name="INT1TMR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="Interval Timer Register" name="INT2TMR" offset="0x270" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="Interval Timer Register" name="INT3TMR" offset="0x470" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="Interval Timer Register" name="INT4TMR" offset="0x670" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="Interval Timer Register" name="INT5TMR" offset="0x870" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="Interval Timer Register" name="INT6TMR" offset="0xa70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="Interval Timer Hold Register" name="INT1HLD" offset="0x80" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="Interval Timer Hold Register" name="INT2HLD" offset="0x280" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="Interval Timer Hold Register" name="INT3HLD" offset="0x480" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="Interval Timer Hold Register" name="INT4HLD" offset="0x680" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="Interval Timer Hold Register" name="INT5HLD" offset="0x880" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="Interval Timer Hold Register" name="INT6HLD" offset="0xa80" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="" name="INDX1CNT" offset="0x90" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX2CNT" offset="0x290" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX3CNT" offset="0x490" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX4CNT" offset="0x690" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX5CNT" offset="0x890" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX6CNT" offset="0xa90" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX1HLD" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="" name="INDX2HLD" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="" name="INDX3HLD" offset="0x4a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="" name="INDX4HLD" offset="0x6a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="" name="INDX5HLD" offset="0x8a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="" name="INDX6HLD" offset="0xaa0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI1ICC" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEIICC" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI2ICC" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEIICC" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI3ICC" offset="0x4b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEIICC" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI4ICC" offset="0x6b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEIICC" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI5ICC" offset="0x8b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEIICC" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI6ICC" offset="0xab0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEIICC" />
         </register>
