Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="Target 4 Permission Group Violation Status bits" name="SBFLAG__T4PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 5 Permission Group Violation Status bits" name="SBFLAG__T5PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 6 Permission Group Violation Status bits" name="SBFLAG__T6PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 7 Permission Group Violation Status bits" name="SBFLAG__T7PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 8 Permission Group Violation Status bits" name="SBFLAG__T8PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 9 Permission Group Violation Status bits" name="SBFLAG__T9PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 10 Permission Group Violation Status bits" name="SBFLAG__T10PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 11 Permission Group Violation Status bits" name="SBFLAG__T11PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 12 Permission Group Violation Status bits" name="SBFLAG__T12PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 13 Permission Group Violation Status bits" name="SBFLAG__T13PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT0ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Write (a non-posted write)" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3" />
         <value caption="Read" name="" value="0x2" />
         <value caption="Write" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Region Number bits" name="SBT0ELOG1__REGION">
         <value caption="Targets region that reported a permission group violation" name="" value="1111 - 0000" />
      </value-group>
      <value-group caption="Initiator ID of Requester bits" name="SBT0ELOG1__INITID">
         <value caption="Reserved" name="" value="0xff" />
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Crypto Engine" name="" value="0xe" />
         <value caption="Flash Controller" name="" value="0xd" />
         <value caption="SQI1" name="" value="0xc" />
         <value caption="CAN2" name="" value="0xb" />
         <value caption="CAN1" name="" value="0xa" />
         <value caption="Ethernet Write" name="" value="0x9" />
         <value caption="Ethernet Read" name="" value="0x8" />
         <value caption="USB" name="" value="0x7" />
         <value caption="DMA Write (DMAPRI (CFGCON) = 1)" name="" value="0x6" />
         <value caption="DMA Write (DMAPRI (CFGCON) = 0)" name="" value="0x5" />
         <value caption="DMA Read (DMAPRI (CFGCON) = 1)" name="" value="0x4" />
         <value caption="DMA Read (DMAPRI (CFGCON) = 0)" name="" value="0x3" />
         <value caption="CPU (CPUPRI (CFGCON) = 1)" name="" value="0x2" />
         <value caption="CPU (CPUPRI (CFGCON) = 0)" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Code bits" name="SBT0ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Permission violation" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x1" />
         <value caption="No error" name="" value="0x0" />
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT0ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1" />
         <value caption="No multiple errors have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT1ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Write (a non-posted write)" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3" />
         <value caption="Read" name="" value="0x2" />
         <value caption="Write" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
