Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
         <register caption="" name="SPI2BUF" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI2BUF"/>
         </register>
         <register caption="" name="SPI3BUF" offset="0x420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI3BUF"/>
         </register>
         <register caption="" name="SPI4BUF" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI4BUF"/>
         </register>
         <register caption="" name="SPI5BUF" offset="0x820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI5BUF"/>
         </register>
         <register caption="" name="SPI6BUF" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI6BUF"/>
         </register>
         <register caption="" name="SPI1BRG" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI1BRG"/>
         </register>
         <register caption="" name="SPI2BRG" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI2BRG"/>
         </register>
         <register caption="" name="SPI3BRG" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI3BRG"/>
         </register>
         <register caption="" name="SPI4BRG" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI4BRG"/>
         </register>
         <register caption="" name="SPI5BRG" offset="0x830" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI5BRG"/>
         </register>
         <register caption="" name="SPI6BRG" offset="0xa30" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI6BRG"/>
         </register>
         <register caption="SPI Control Register 2" name="SPI1CON2" offset="0x40" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI1CON2__AUDMOD"/>
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI1CON2__AUDMONO"/>
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI1CON2__AUDEN"/>
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI1CON2__IGNTUR"/>
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI1CON2__IGNROV"/>
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI1CON2__SPITUREN"/>
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI1CON2__SPIROVEN"/>
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI1CON2__FRMERREN"/>
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI1CON2__SPISGNEXT"/>
         </register>
         <register caption="SPI Control Register 2" name="SPI2CON2" offset="0x240" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI2CON2__AUDMOD"/>
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI2CON2__AUDMONO"/>
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI2CON2__AUDEN"/>
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI2CON2__IGNTUR"/>
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI2CON2__IGNROV"/>
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI2CON2__SPITUREN"/>
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI2CON2__SPIROVEN"/>
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI2CON2__FRMERREN"/>
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI2CON2__SPISGNEXT"/>
         </register>
         <register caption="SPI Control Register 2" name="SPI3CON2" offset="0x440" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI3CON2__AUDMOD"/>
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI3CON2__AUDMONO"/>
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI3CON2__AUDEN"/>
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI3CON2__IGNTUR"/>
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI3CON2__IGNROV"/>
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI3CON2__SPITUREN"/>
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI3CON2__SPIROVEN"/>
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI3CON2__FRMERREN"/>
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI3CON2__SPISGNEXT"/>
         </register>
         <register caption="SPI Control Register 2" name="SPI4CON2" offset="0x640" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI4CON2__AUDMOD"/>
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI4CON2__AUDMONO"/>
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI4CON2__AUDEN"/>
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI4CON2__IGNTUR"/>
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI4CON2__IGNROV"/>
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI4CON2__SPITUREN"/>
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI4CON2__SPIROVEN"/>
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI4CON2__FRMERREN"/>
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI4CON2__SPISGNEXT"/>
         </register>
