Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
         <register caption="USB Control Register (x = 1 and 2)" name="U2CON" offset="0x1210" rw="RW" size="4">
            <bitfield caption="(Device mode)USB Module Enable bit / (Host mode)" mask="0x00000001" name="USBEN_SOFEN" values="U2CON__USBEN_SOFEN" />
            <bitfield caption="Ping-Pong Buffers Reset bit" mask="0x00000002" name="PPBRST" values="U2CON__PPBRST" />
            <bitfield caption="RESUME Signaling Enable bit" mask="0x00000004" name="RESUME" values="U2CON__RESUME" />
            <bitfield caption="Host Mode Enable bit" mask="0x00000008" name="HOSTEN" values="U2CON__HOSTEN" />
            <bitfield caption="Module Reset bit" mask="0x00000010" name="USBRST" values="U2CON__USBRST" />
            <bitfield caption="(Device mode) Packet Transfer Disable bit / (Host mode) Token Busy Indicator bit" mask="0x00000020" name="PKTDIS_TOKBUSY" values="U2CON__PKTDIS_TOKBUSY" />
            <bitfield caption="Live Single-Ended Zero flag bit" mask="0x00000040" name="SE0" values="U2CON__SE0" />
            <bitfield caption="Live Differential Receiver JSTATE flag bit" mask="0x00000080" name="JSTATE" values="U2CON__JSTATE" />
         </register>
         <register caption="USB Address Register (x = 1 and 2)" name="U1ADDR" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="DEVADDR" />
            <bitfield caption="Low Speed Enable Indicator bit" mask="0x00000080" name="LSPDEN" values="U1ADDR__LSPDEN" />
         </register>
         <register caption="USB Address Register (x = 1 and 2)" name="U2ADDR" offset="0x1220" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="DEVADDR" />
            <bitfield caption="Low Speed Enable Indicator bit" mask="0x00000080" name="LSPDEN" values="U2ADDR__LSPDEN" />
         </register>
         <register caption="USB BDT Page 1 Register (x = 1 and 2)" name="U1BDTP1" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x000000FE" name="BDTPTRL" />
         </register>
         <register caption="USB BDT Page 1 Register (x = 1 and 2)" name="U2BDTP1" offset="0x1230" rw="RW" size="4">
            <bitfield mask="0x000000FE" name="BDTPTRL" />
         </register>
         <register caption="USB Frame Number Low Register (x = 1 and 2)" name="U1FRML" offset="0x240" rw="R" size="4">
            <bitfield mask="0x000000FF" name="FRML" />
         </register>
         <register caption="USB Frame Number Low Register (x = 1 and 2)" name="U2FRML" offset="0x1240" rw="R" size="4">
            <bitfield mask="0x000000FF" name="FRML" />
         </register>
         <register caption="USB Frame Number High Register (x = 1 and 2)" name="U1FRMH" offset="0x250" rw="R" size="4">
            <bitfield mask="0x00000007" name="FRMH" />
         </register>
         <register caption="USB Frame Number High Register (x = 1 and 2)" name="U2FRMH" offset="0x1250" rw="R" size="4">
            <bitfield mask="0x00000007" name="FRMH" />
         </register>
         <register caption="USB Token Register (x = 1 and 2)" name="U1TOK" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="EP" />
            <bitfield caption="Token Type Indicator bits" mask="0x000000F0" name="PID" values="U1TOK__PID" />
         </register>
         <register caption="USB Token Register (x = 1 and 2)" name="U2TOK" offset="0x1260" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="EP" />
            <bitfield caption="Token Type Indicator bits" mask="0x000000F0" name="PID" values="U2TOK__PID" />
         </register>
         <register caption="USB SOF Threshold Register (x = 1 and 2)" name="U1SOF" offset="0x270" rw="RW" size="4">
            <bitfield caption="SOF Threshold Value bits" mask="0x000000FF" name="CNT" values="U1SOF__CNT" />
         </register>
         <register caption="USB SOF Threshold Register (x = 1 and 2)" name="U2SOF" offset="0x1270" rw="RW" size="4">
            <bitfield caption="SOF Threshold Value bits" mask="0x000000FF" name="CNT" values="U2SOF__CNT" />
         </register>
         <register caption="USB BDT PAGE 2 Register (x = 1 and 2)" name="U1BDTP2" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BDTPTRH" />
         </register>
         <register caption="USB BDT PAGE 2 Register (x = 1 and 2)" name="U2BDTP2" offset="0x1280" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BDTPTRH" />
         </register>
         <register caption="USB BDT PAGE 3 Register (x = 1 and 2)" name="U1BDTP3" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BDTPTRU" />
         </register>
         <register caption="USB BDT PAGE 3 Register (x = 1 and 2)" name="U2BDTP3" offset="0x1290" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BDTPTRU" />
         </register>
         <register caption="USB Configuration 1 Register (x = 1 and 2)" name="U1CNFG1" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="Automatic Suspend Enable bit" mask="0x00000001" name="UASUSPND" values="U1CNFG1__UASUSPND" />
            <bitfield caption="Low-Speed Device Enable bit" mask="0x00000008" name="LSDEV" values="U1CNFG1__LSDEV" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00000010" name="USBSIDL" values="U1CNFG1__USBSIDL" />
            <bitfield caption="USB" mask="0x00000040" name="UOEMON" values="U1CNFG1__UOEMON" />
            <bitfield caption="USB Eye-Pattern Test Enable bit" mask="0x00000080" name="UTEYE" values="U1CNFG1__UTEYE" />
         </register>
         <register caption="USB Configuration 1 Register (x = 1 and 2)" name="U2CNFG1" offset="0x12a0" rw="RW" size="4">
            <bitfield caption="Automatic Suspend Enable bit" mask="0x00000001" name="UASUSPND" values="U2CNFG1__UASUSPND" />
            <bitfield caption="Low-Speed Device Enable bit" mask="0x00000008" name="LSDEV" values="U2CNFG1__LSDEV" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00000010" name="USBSIDL" values="U2CNFG1__USBSIDL" />
            <bitfield caption="USB" mask="0x00000040" name="UOEMON" values="U2CNFG1__UOEMON" />
            <bitfield caption="USB Eye-Pattern Test Enable bit" mask="0x00000080" name="UTEYE" values="U2CNFG1__UTEYE" />
         </register>
         <register caption="USB Endpoint Control Register 0" name="U1EP0" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP0__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP0__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP0__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP0__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP0__EPCONDIS" />
            <bitfield caption="Retry Disable bit" mask="0x00000040" name="RETRYDIS" values="U1EP0__RETRYDIS" />
            <bitfield caption="Low-Speed Direct Connection Enable bit" mask="0x00000080" name="LSPD" values="U1EP0__LSPD" />
         </register>
         <register caption="USB Endpoint Control Register 0" name="U2EP0" offset="0x12c0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U2EP0__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U2EP0__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U2EP0__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U2EP0__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U2EP0__EPCONDIS" />
            <bitfield caption="Retry Disable bit" mask="0x00000040" name="RETRYDIS" values="U2EP0__RETRYDIS" />
            <bitfield caption="Low-Speed Direct Connection Enable bit" mask="0x00000080" name="LSPD" values="U2EP0__LSPD" />
         </register>
         <register caption="USB Endpoint Control Register 1" name="U1EP1" offset="0x2d0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP1__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP1__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP1__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP1__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP1__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 1" name="U2EP1" offset="0x12d0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U2EP1__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U2EP1__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U2EP1__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U2EP1__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U2EP1__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 2" name="U1EP2" offset="0x2e0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP2__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP2__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP2__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP2__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP2__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 2" name="U2EP2" offset="0x12e0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U2EP2__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U2EP2__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U2EP2__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U2EP2__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U2EP2__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 3" name="U1EP3" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP3__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP3__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP3__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP3__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP3__EPCONDIS" />
         </register>
