Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="A-Device" name="U2OTGIR__VBUSVDIF">
         <value caption="Change on the session valid input is detected" name="" value="0x1" />
         <value caption="No change on the session valid input is detected" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Device" name="U2OTGIR__SESENDIF">
         <value caption="A change on the session end input was detected" name="" value="0x1" />
         <value caption="No change on the session end input was detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Valid Change Indicator bit" name="U2OTGIR__SESVDIF">
         <value caption="Vbus voltage has dropped below the session end level" name="" value="0x1" />
         <value caption="Vbus voltage has not dropped below the session end level" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Activity Indicator bit" name="U2OTGIR__ACTVIF">
         <value caption="Activity on the D+" name="" value="0x1" />
         <value caption="Activity has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Line State Stable Indicator bit" name="U2OTGIR__LSTATEIF">
         <value caption="USB line state has been stable for 1 millisecond" name="" value="0x1" />
         <value caption="USB line state has not been stable for 1 millisecond" name="" value="0x0" />
      </value-group>
      <value-group caption="1 Millisecond Timer bit" name="U2OTGIR__T1MSECIF">
         <value caption="1 millisecond timer has expired" name="" value="0x1" />
         <value caption="1 millisecond timer has not expired" name="" value="0x0" />
      </value-group>
      <value-group caption="ID State Change Indicator bit" name="U2OTGIR__IDIF">
         <value caption="Change in ID state is detected" name="" value="0x1" />
         <value caption="No change in ID state is detected" name="" value="0x0" />
      </value-group>
      <value-group caption="A- Vbus Valid Interrupt Enable bit" name="U1OTGIE__VBUSVDIE">
         <value caption="A-Vbus valid interrupt is enabled" name="" value="0x1" />
         <value caption="A-Vbus valid interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Session End Interrupt Enable bit" name="U1OTGIE__SESENDIE">
         <value caption="B-session end interrupt is enabled" name="" value="0x1" />
         <value caption="B-session end interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Valid Interrupt Enable bit" name="U1OTGIE__SESVDIE">
         <value caption="Session valid interrupt is enabled" name="" value="0x1" />
         <value caption="Session valid interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Activity Interrupt Enable bit" name="U1OTGIE__ACTVIE">
         <value caption="ACTIVITY interrupt is enabled" name="" value="0x1" />
         <value caption="ACTIVITY interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Line State Interrupt Enable bit" name="U1OTGIE__LSTATEIE">
         <value caption="Line state interrupt is enabled" name="" value="0x1" />
         <value caption="Line state interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="1 Millisecond Timer Interrupt Enable bit" name="U1OTGIE__T1MSECIE">
         <value caption="1 millisecond timer interrupt is enabled" name="" value="0x1" />
         <value caption="1 millisecond timer interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ID Interrupt Enable bit" name="U1OTGIE__IDIE">
         <value caption="ID interrupt is enabled" name="" value="0x1" />
         <value caption="ID interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="A- Vbus Valid Interrupt Enable bit" name="U2OTGIE__VBUSVDIE">
         <value caption="A-Vbus valid interrupt is enabled" name="" value="0x1" />
         <value caption="A-Vbus valid interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Session End Interrupt Enable bit" name="U2OTGIE__SESENDIE">
         <value caption="B-session end interrupt is enabled" name="" value="0x1" />
         <value caption="B-session end interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Valid Interrupt Enable bit" name="U2OTGIE__SESVDIE">
         <value caption="Session valid interrupt is enabled" name="" value="0x1" />
         <value caption="Session valid interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Activity Interrupt Enable bit" name="U2OTGIE__ACTVIE">
         <value caption="ACTIVITY interrupt is enabled" name="" value="0x1" />
         <value caption="ACTIVITY interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Line State Interrupt Enable bit" name="U2OTGIE__LSTATEIE">
         <value caption="Line state interrupt is enabled" name="" value="0x1" />
         <value caption="Line state interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="1 Millisecond Timer Interrupt Enable bit" name="U2OTGIE__T1MSECIE">
         <value caption="1 millisecond timer interrupt is enabled" name="" value="0x1" />
         <value caption="1 millisecond timer interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ID Interrupt Enable bit" name="U2OTGIE__IDIE">
         <value caption="ID interrupt is enabled" name="" value="0x1" />
         <value caption="ID interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="A-Device Vbus Valid Indicator bit" name="U1OTGSTAT__VBUSVD">
         <value caption="Vbus voltage is above Session Valid on the A device" name="" value="0x1" />
         <value caption="Vbus voltage is below Session Valid on the A device" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Device Session End Indicator bit" name="U1OTGSTAT__SESEND">
         <value caption="Vbus voltage is below Session Valid on the B device" name="" value="0x1" />
         <value caption="Vbus voltage is above Session Valid on the B device" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Valid Indicator bit" name="U1OTGSTAT__SESVD">
         <value caption="Vbus voltage is above Session Valid on the A or B device" name="" value="0x1" />
         <value caption="Vbus voltage is below Session Valid on the A or B device" name="" value="0x0" />
      </value-group>
      <value-group caption="Line State Stable Indicator bit" name="U1OTGSTAT__LSTATE">
         <value caption="USB line state (SE0 (UxCON) and JSTATE (UxCON&lt;7&gt;)) has been stable for the previous 1 ms" name="" value="0x1" />
         <value caption="USB line state (SE0 and JSTATE) has not been stable for the previous 1 ms" name="" value="0x0" />
      </value-group>
      <value-group caption="ID Pin State Indicator bit" name="U1OTGSTAT__ID">
         <value caption="No cable is attached or a Type-B cable has been plugged into the USB receptacle" name="" value="0x1" />
         <value caption="A Type-A cable has been plugged into the USB receptacle" name="" value="0x0" />
      </value-group>
      <value-group caption="A-Device Vbus Valid Indicator bit" name="U2OTGSTAT__VBUSVD">
         <value caption="Vbus voltage is above Session Valid on the A device" name="" value="0x1" />
         <value caption="Vbus voltage is below Session Valid on the A device" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Device Session End Indicator bit" name="U2OTGSTAT__SESEND">
         <value caption="Vbus voltage is below Session Valid on the B device" name="" value="0x1" />
         <value caption="Vbus voltage is above Session Valid on the B device" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Valid Indicator bit" name="U2OTGSTAT__SESVD">
         <value caption="Vbus voltage is above Session Valid on the A or B device" name="" value="0x1" />
         <value caption="Vbus voltage is below Session Valid on the A or B device" name="" value="0x0" />
      </value-group>
      <value-group caption="Line State Stable Indicator bit" name="U2OTGSTAT__LSTATE">
         <value caption="USB line state (SE0 (UxCON) and JSTATE (UxCON&lt;7&gt;)) has been stable for the previous 1 ms" name="" value="0x1" />
         <value caption="USB line state (SE0 and JSTATE) has not been stable for the previous 1 ms" name="" value="0x0" />
      </value-group>
      <value-group caption="ID Pin State Indicator bit" name="U2OTGSTAT__ID">
         <value caption="No cable is attached or a Type-B cable has been plugged into the USB receptacle" name="" value="0x1" />
         <value caption="A Type-A cable has been plugged into the USB receptacle" name="" value="0x0" />
      </value-group>
