Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK0512MCF100.atdf
      <value-group caption="Low-Speed Direct Connection Enable bit" name="U2EP0__LSPD">
         <value caption="Direct connection to a low-speed device is enabled" name="" value="0x1" />
         <value caption="Direct connection to a low-speed device is disabled; hub required with PRE_PID" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP1__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP1__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP1__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP1__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP1__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U2EP1__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U2EP1__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U2EP1__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U2EP1__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U2EP1__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP2__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP2__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP2__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP2__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP2__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U2EP2__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U2EP2__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U2EP2__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U2EP2__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
